<?php
$brown = [
    'name' => '文湖線',
    'stations' => [
        [
            'id' => 'B11',
            'name' => '南港展覽館',
            'addr' => '11568 台北市南港區南港路一段32號',
            'lat' => 25.055288,
            'lon' => 121.6175001
        ],
        [
            'id' => 'B10',
            'name' => '南港軟體園區',
            'addr' => '11568 台北市南港區經貿二路183號',
            'lat' => 25.059905,
            'lon' => 121.615953
        ],
        [
            'id' => 'B9',
            'name' => '東湖',
            'addr' => '11486 台北市內湖區康寧路三段235號',
            'lat' => 25.067147,
            'lon' => 121.611445
        ],
        [
            'id' => 'B8',
            'name' => '葫洲',
            'addr' => '11486 台北市內湖區康寧路三段16號',
            'lat' => 25.072701,
            'lon' => 121.607158
        ],
        [
            'id' => 'B7',
            'name' => '大湖公園',
            'addr' => '11477 台北市內湖區成功路五段11號',
            'lat' => 25.083845,
            'lon' => 121.602141
        ],
        [
            'id' => 'B6',
            'name' => '內湖',
            'addr' => '11489 台北市內湖區成功路四段186號',
            'lat' => 25.083661,
            'lon' => 121.594408
        ],
        [
            'id' => 'B5',
            'name' => '文德',
            'addr' => '11475 台北市內湖區文德路214號',
            'lat' => 25.078532,
            'lon' => 121.584761
        ],
        [
            'id' => 'B4',
            'name' => '港墘',
            'addr' => '11446 台北市內湖區內湖路一段663號',
            'lat' => 25.080028,
            'lon' => 121.575081
        ],
        [
            'id' => 'B3',
            'name' => '西湖',
            'addr' => '11493 台北市內湖區內湖路一段256號',
            'lat' => 25.082133,
            'lon' => 121.567213
        ],
        [
            'id' => 'B2',
            'name' => '劍南路',
            'addr' => '10464 台北市中山區北安路798號',
            'lat' => 25.084853,
            'lon' => 121.555592
        ],
        [
            'id' => 'B1',
            'name' => '大直',
            'addr' => '10465 台北市中山區北安路534之1號',
            'lat' => 25.079477,
            'lon' => 121.546895
        ],
        [
            'id' => 'BR1',
            'name' => '松山機場',
            'addr' => '10576 台北市松山區敦化北路338號',
            'lat' => 25.063,
            'lon' => 121.551996
        ],
        [
            'id' => 'BR2',
            'name' => '中山國中',
            'addr' => '10476 台北市中山區復興北路376號',
            'lat' => 25.060849,
            'lon' => 121.544227
        ],
        [
            'id' => 'BR3',
            'name' => '南京東路',
            'addr' => '10550 台北市松山區南京東路三段253號',
            'lat' => 25.052319,
            'lon' => 121.544011
        ],
        [
            'id' => 'BR4',
            'name' => '忠孝復興',
            'addr' => '10654 台北市大安區忠孝東路四段47號',
            'lat' => 25.041629,
            'lon' => 121.543767
        ],
        [
            'id' => 'BR5',
            'name' => '大安',
            'addr' => '10683 台北市大安區信義路四段2號',
            'lat' => 25.032943,
            'lon' => 121.543551
        ],
        [
            'id' => 'BR6',
            'name' => '科技大樓',
            'addr' => '10667 台北市大安區復興南路二段235號',
            'lat' => 25.026125,
            'lon' => 121.543437
        ],
        [
            'id' => 'BR7',
            'name' => '六張犁',
            'addr' => '10674 台北市大安區和平東路三段168號',
            'lat' => 25.023777,
            'lon' => 121.553115
        ],
        [
            'id' => 'BR8',
            'name' => '麟光',
            'addr' => '10676 台北市大安區和平東路三段410號',
            'lat' => 25.018535,
            'lon' => 121.558791
        ],
        [
            'id' => 'BR9',
            'name' => '辛亥',
            'addr' => '11694 台北市文山區辛亥路四段128號',
            'lat' => 25.005475,
            'lon' => 121.557107
        ],
        [
            'id' => 'BR10',
            'name' => '萬芳醫院',
            'addr' => '11696 台北市文山區興隆路三段113號',
            'lat' => 24.999386,
            'lon' => 121.558152
        ],
        [
            'id' => 'BR11',
            'name' => '萬芳社區',
            'addr' => '11653 台北市文山區萬芳路60號',
            'lat' => 24.998585,
            'lon' => 121.568102
        ],
        [
            'id' => 'BR12',
            'name' => '木柵',
            'addr' => '11656 台北市文山區木柵路四段135號',
            'lat' => 24.998241,
            'lon' => 121.573145
        ],
        [
            'id' => 'BR13',
            'name' => '動物園',
            'addr' => '11656 台北市文山區新光路二段32號',
            'lat' => 24.998197,
            'lon' => 121.579338
        ]
    ]
];

$tpe_red = [
    'name' => '淡水線',
    'stations' => [
        [
            'id' => 'R33',
            'name' => '淡水',
            'addr' => '25158 新北市淡水區中正路1號',
            'lat' => 25.167818,
            'lon' => 121.445561
        ],
        [
            'id' => 'R32',
            'name' => '紅樹林',
            'addr' => '25173 新北市淡水區中正東路二段68號',
            'lat' => 25.154042,
            'lon' => 121.458872
        ],
        [
            'id' => 'R31',
            'name' => '竹圍',
            'addr' => '25173 新北市淡水區民權路50號',
            'lat' => 25.13694,
            'lon' => 121.459479
        ],
        [
            'id' => 'R30',
            'name' => '關渡',
            'addr' => '11259 台北市北投區大度路三段296巷51號',
            'lat' => 25.125633,
            'lon' => 121.467102
        ],
        [
            'id' => 'R29',
            'name' => '忠義',
            'addr' => '11257 台北市北投區中央北路四段301號',
            'lat' => 25.130969,
            'lon' => 121.47341
        ],
        [
            'id' => 'R28',
            'name' => '復興崗',
            'addr' => '11257 台北市北投區中央北路三段53巷10號',
            'lat' => 25.137474,
            'lon' => 121.485444
        ],
        [
            'id' => 'R26',
            'name' => '北投',
            'addr' => '11246 台北市北投區光明路1號',
            'lat' => 25.131841,
            'lon' => 121.498633
        ],
        [
            'id' => 'R25',
            'name' => '奇岩',
            'addr' => '11270 台北市北投區三合街二段489號',
            'lat' => 25.125491,
            'lon' => 121.501132
        ],
        [
            'id' => 'R24',
            'name' => '唭哩岸',
            'addr' => '11265 台北市北投區東華街二段301號',
            'lat' => 25.120872,
            'lon' => 121.506252
        ],
        [
            'id' => 'R23',
            'name' => '石牌',
            'addr' => '11271 台北市北投區石牌路一段200號',
            'lat' => 25.114523,
            'lon' => 121.515559
        ],
        [
            'id' => 'R22',
            'name' => '明德',
            'addr' => '11280 台北市北投區明德路95號',
            'lat' => 25.109721,
            'lon' => 121.518848
        ],
        [
            'id' => 'R21',
            'name' => '芝山',
            'addr' => '11158 台北市士林區福國路70號',
            'lat' => 25.10306,
            'lon' => 121.522514
        ],
        [
            'id' => 'R20',
            'name' => '士林',
            'addr' => '11163 台北市士林區福德路1號',
            'lat' => 25.093535,
            'lon' => 121.52623
        ],
        [
            'id' => 'R18A',
            'name' => '劍潭',
            'addr' => '11163 台北市士林區中山北路五段65號',
            'lat' => 25.084873,
            'lon' => 121.525078
        ],
        [
            'id' => 'R17',
            'name' => '圓山',
            'addr' => '10367 台北市大同區酒泉街9之1號',
            'lat' => 25.071353,
            'lon' => 121.520118
        ],
        [
            'id' => 'R16',
            'name' => '民權西路',
            'addr' => '10365 台北市大同區民權西路72號',
            'lat' => 25.062905,
            'lon' => 121.51932
        ],
        [
            'id' => 'R15',
            'name' => '雙連',
            'addr' => '10354 台北市大同區民生西路47號',
            'lat' => 25.057805,
            'lon' => 121.520627
        ],
        [
            'id' => 'R14',
            'name' => '中山',
            'addr' => '10444 台北市中山區南京西路16號',
            'lat' => 25.052685,
            'lon' => 121.520392
        ],
        [
            'id' => 'R13',
            'name' => '台北車站',
            'addr' => '10041 台北市中正區忠孝西路一段49號',
            'lat' => 25.046255,
            'lon' => 121.517532
        ],
        [
            'id' => 'R12',
            'name' => '台大醫院',
            'addr' => '10048 台北市中正區公園路52號B1',
            'lat' => 25.041256,
            'lon' => 121.51604
        ],
        [
            'id' => 'R11',
            'name' => '中正紀念堂',
            'addr' => '10074 台北市中正區羅斯福路一段8之1號B1',
            'lat' => 25.032729,
            'lon' => 121.51827
        ],
        [
            'id' => 'R10',
            'name' => '東門',
            'future' => true,
            'addr' => '10650 台北市大安區信義路二段166號B1',
            'lat' => 25.033847,
            'lon' => 121.528739
        ],
        [
            'id' => 'R9',
            'name' => '大安森林公園',
            'future' => true
        ],
        [
            'id' => 'R8',
            'name' => '大安',
            'future' => true,
            'addr' => '10683 台北市大安區信義路四段2號',
            'lat' => 25.032943,
            'lon' => 121.543551
        ],
        [
            'id' => 'R7',
            'name' => '信義安和',
            'future' => true
        ],
        [
            'id' => 'R6',
            'name' => '台北101/世貿',
            'future' => true
        ],
        [
            'id' => 'R5',
            'name' => '象山',
            'future' => true
        ],
        [
            'id' => 'R4',
            'future' => true
        ],
        [
            'id' => 'R3',
            'future' => true
        ]
    ]
];

$xinbeitou = [
    'name' => '新北投支線',
    'stations' => [
        [
            'id' => 'R27',
            'name' => '新北投',
            'addr' => '11268 台北市北投區大業路700號',
            'lat' => 25.136933,
            'lon' => 121.50253
        ]
    ]
];

$green = [
    'name' => '新店線',
    'stations' => [
        [
            'id' => 'G22',
            'name' => '松山',
            'future' => true,
            'addr' => '11088 台北市信義區松山路11號',
            'lat' => 25.049283,
            'lon' => 121.578012
        ],
        [
            'id' => 'G21',
            'name' => '南京三民',
            'future' => true
        ],
        [
            'id' => 'G19',
            'name' => '台北小巨蛋',
            'future' => true
        ],
        [
            'id' => 'G18',
            'name' => '南京復興',
            'future' => true,
            'addr' => '10550 台北市松山區南京東路三段253號',
            'lat' => 25.052319,
            'lon' => 121.544011
        ],
        [
            'id' => 'G17',
            'name' => '松江南京',
            'future' => true,
            'addr' => '10457 台北市中山區松江路126號B1',
            'lat' => 25.052015,
            'lon' => 121.533076
        ],
        [
            'id' => 'G16',
            'name' => '中山',
            'future' => true,
            'addr' => '10444 台北市中山區南京西路16號',
            'lat' => 25.052685,
            'lon' => 121.520392
        ],
        [
            'id' => 'G14',
            'name' => '北門',
            'future' => true
        ],
        [
            'id' => 'G13',
            'name' => '西門',
            'addr' => '10042 台北市中正區寶慶路32之1號B1',
            'lat' => 25.04209,
            'lon' => 121.508303
        ],
        [
            'id' => 'G12',
            'name' => '小南門',
            'addr' => '10066 台北市中正區愛國西路22號B1',
            'lat' => 25.035547,
            'lon' => 121.510857
        ],
        [
            'id' => 'G11',
            'name' => '中正紀念堂',
            'addr' => '10074 台北市中正區羅斯福路一段8之1號B1',
            'lat' => 25.032729,
            'lon' => 121.51827
        ],
        [
            'id' => 'G10',
            'name' => '古亭',
            'addr' => '10084 台北市中正區羅斯福路二段164之1號B1',
            'lat' => 25.026357,
            'lon' => 121.522873
        ],
        [
            'id' => 'G9',
            'name' => '台電大樓',
            'addr' => '10089 台北市中正區羅斯福路三段126之5號B1',
            'lat' => 25.020725,
            'lon' => 121.528168
        ],
        [
            'id' => 'G7',
            'name' => '公館',
            'addr' => '10091 台北市中正區羅斯福路四段74號B1',
            'lat' => 25.014908,
            'lon' => 121.534216
        ],
        [
            'id' => 'G6',
            'name' => '萬隆',
            'addr' => '11678 台北市文山區羅斯福路五段214號',
            'lat' => 25.001853,
            'lon' => 121.539051
        ],
        [
            'id' => 'G5',
            'name' => '景美',
            'addr' => '11674 台北市文山區羅斯福路六段393號',
            'lat' => 24.9921276,
            'lon' => 121.5406037
        ],
        [
            'id' => 'G4',
            'name' => '大坪林',
            'addr' => '23143 新北市新店區北新路三段190號',
            'lat' => 24.982899,
            'lon' => 121.541352
        ],
        [
            'id' => 'G3',
            'name' => '七張',
            'addr' => '23143 新北市新店區北新路二段150號',
            'lat' => 24.975169,
            'lon' => 121.542942
        ],
        [
            'id' => 'G2',
            'name' => '新店區公所',
            'addr' => '23147 新北市新店區北新路一段295號',
            'lat' => 24.967393,
            'lon' => 121.54131
        ],
        [
            'id' => 'G1',
            'name' => '新店',
            'addr' => '23152 新北市新店區北宜路一段2號',
            'lat' => 24.957855,
            'lon' => 121.537584
        ]
    ]
];

$xiaobitan = [
    'name' => '小碧潭支線',
    'stations' => [
        [
            'id' => 'G1A',
            'name' => '小碧潭',
            'addr' => '23150 新北市新店區中央路151號4樓',
            'lat' => 24.971907,
            'lon' => 121.530339
        ]
    ]
];

$tpe_orange = [
    'name' => '中和新蘆線',
    'stations' => [
        [
            'id' => 'O43',
            'name' => '蘆洲',
            'addr' => '24760 新北市蘆洲區三民路386號B1',
            'lat' => 25.091554,
            'lon' => 121.464471
        ],
        [
            'id' => 'O44',
            'name' => '三民高中',
            'addr' => '24760 新北市蘆洲區三民路105號B1',
            'lat' => 25.085456,
            'lon' => 121.473389
        ],
        [
            'id' => 'O45',
            'name' => '徐匯中學',
            'addr' => '24753 新北市蘆洲區中山一路3號B1',
            'lat' => 25.080728,
            'lon' => 121.479673
        ],
        [
            'id' => 'O46',
            'name' => '三和國中',
            'addr' => '24152 新北市三重區三和路四段107號B1',
            'lat' => 25.076859,
            'lon' => 121.486347
        ],
        [
            'id' => 'O47',
            'name' => '三重國小',
            'addr' => '24149 新北市三重區三和路三段5號B1',
            'lat' => 25.070319,
            'lon' => 121.496904
        ],
        [
            'id' => 'O59',
            'name' => '迴龍',
            'future' => true,
            'lat' => 25.02254,
            'lon' => 121.47213
        ],
        [
            'id' => 'O60',
            'name' => '丹鳳',
            'future' => true,
            'lat' => 25.0288671,
            'lon' => 121.4227079
        ],
        [
            'id' => 'O1',
            'name' => '輔大',
            'addr' => '24205 新北市新莊區中正路510之1號B1',
            'lat' => 25.032718,
            'lon' => 121.43547
        ],
        [
            'id' => 'O2',
            'name' => '新莊',
            'addr' => '24243 新北市新莊區中正路138號B1',
            'lat' => 25.036125,
            'lon' => 121.452468
        ],
        [
            'id' => 'O3',
            'name' => '頭前庄',
            'addr' => '24251 新北市新莊區思源路18號B1',
            'lat' => 25.039705,
            'lon' => 121.461746
        ],
        [
            'id' => 'O4',
            'name' => '先嗇宮',
            'addr' => '24158 新北市三重區重新路五段515號B1',
            'lat' => 25.046493,
            'lon' => 121.471916
        ],
        [
            'id' => 'O5',
            'name' => '三重',
            'addr' => '24161 新北市三重區捷運路36號B1',
            'lat' => 25.055791,
            'lon' => 121.484725
        ],
        [
            'id' => 'O6',
            'name' => '菜寮',
            'addr' => '24143 新北市三重區重新路三段150號B1',
            'lat' => 25.060274,
            'lon' => 121.492156
        ],
        [
            'id' => 'O7',
            'name' => '台北橋',
            'addr' => '24142 新北市三重區重新路一段108號B1',
            'lat' => 25.063274,
            'lon' => 121.500762
        ],
        [
            'id' => 'O8',
            'name' => '大橋頭',
            'addr' => '10357 台北市大同區民權西路223號B1',
            'lat' => 25.063256,
            'lon' => 121.51272
        ],
        [
            'id' => 'O9',
            'name' => '民權西路',
            'addr' => '10365 台北市大同區民權西路72號',
            'lat' => 25.062202,
            'lon' => 121.519625
        ],
        [
            'id' => 'O10',
            'name' => '中山國小',
            'addr' => '10452 台北市中山區民權東路一段71號B1',
            'lat' => 25.062694,
            'lon' => 121.526419
        ],
        [
            'id' => 'O11',
            'name' => '行天宮',
            'addr' => '10468 台北市中山區松江路316號B1',
            'lat' => 25.059718,
            'lon' => 121.533185
        ],
        [
            'id' => 'O12',
            'name' => '松江南京',
            'addr' => '10457 台北市中山區松江路126號B1',
            'lat' => 25.0526894,
            'lon' => 121.5327444
        ],
        [
            'id' => 'O13',
            'name' => '忠孝新生',
            'addr' => '10652 台北市大安區新生南路一段67號',
            'lat' => 25.042356,
            'lon' => 121.532905
        ],
        [
            'id' => 'O14',
            'name' => '東門',
            'addr' => '10650 台北市大安區信義路二段166號B1',
            'lat' => 25.033847,
            'lon' => 121.528739
        ],
        [
            'id' => 'O15',
            'name' => '古亭',
            'addr' => '10084 台北市中正區羅斯福路二段164之1號B1',
            'lat' => 25.026357,
            'lon' => 121.522873
        ],
        [
            'id' => 'O16',
            'name' => '頂溪',
            'addr' => '23445 新北市永和區永和路二段168號B1',
            'lat' => 25.013821,
            'lon' => 121.515485
        ],
        [
            'id' => 'O17',
            'name' => '永安市場',
            'addr' => '23574 新北市中和區中和路388號',
            'lat' => 25.002876,
            'lon' => 121.511231
        ],
        [
            'id' => 'O18',
            'name' => '景安',
            'addr' => '23582 新北市中和區景平路486號',
            'lat' => 24.993905,
            'lon' => 121.505113
        ],
        [
            'id' => 'O19',
            'name' => '南勢角',
            'addr' => '23566 新北市中和區捷運路6號',
            'lat' => 24.990045,
            'lon' => 121.509237
        ]
    ]
];

$blue = [
    'name' => '板南線',
    'stations' => [
        [
            'id' => 'BL18',
            'name' => '南港展覽館',
            'addr' => '11568 台北市南港區研究院路一段1號',
        ],
        [
            'id' => 'BL17',
            'name' => '南港',
            'addr' => '11561 台北市南港區忠孝東路七段380號',
        ],
        [
            'id' => 'BL16',
            'name' => '昆陽',
            'addr' => '11558 台北市南港區忠孝東路六段451號',
        ],
        [
            'id' => 'BL15',
            'name' => '後山埤',
            'addr' => '11575 台北市南港區忠孝東路六段2號',
        ],
        [
            'id' => 'BL14',
            'name' => '永春',
            'addr' => '11061 台北市信義區忠孝東路五段455號',
        ],
        [
            'id' => 'BL13',
            'name' => '市政府',
            'addr' => '11071 台北市信義區忠孝東路五段2號',
        ],
        [
            'id' => 'BL12',
            'name' => '國父紀念館',
            'addr' => '11072 台北市信義區忠孝東路四段400號',
        ],
        [
            'id' => 'BL11',
            'name' => '忠孝敦化',
            'addr' => '10686 台北市大安區忠孝東路四段182號',
        ],
        [
            'id' => 'BL10',
            'name' => '忠孝復興',
            'addr' => '10654 台北市大安區忠孝東路四段47號',
            'lat' => 25.041629,
            'lon' => 121.543767
        ],
        [
            'id' => 'BL9',
            'name' => '忠孝新生',
            'addr' => '10652 台北市大安區新生南路一段67號',
            'lat' => 25.042356,
            'lon' => 121.532905
        ],
        [
            'id' => 'BL8',
            'name' => '善導寺',
            'addr' => '10049 台北市中正區忠孝東路一段58號B1',
        ],
        [
            'id' => 'BL7',
            'name' => '台北車站',
            'addr' => '10041 台北市中正區忠孝西路一段49號',
            'lat' => 25.046255,
            'lon' => 121.517532
        ],
        [
            'id' => 'BL6',
            'name' => '西門',
            'addr' => '10042 台北市中正區寶慶路32之1號B1',
            'lat' => 25.04209,
            'lon' => 121.508303
        ],
        [
            'id' => 'BL5',
            'name' => '龍山寺',
            'addr' => '10855 台北市萬華區西園路一段153號',
        ],
        [
            'id' => 'BL4',
            'name' => '江子翠',
            'addr' => '22044 新北市板橋區文化路二段296號B1',
        ],
        [
            'id' => 'BL3',
            'name' => '新埔',
            'addr' => '22047 新北市板橋區民生路三段2號B1',
        ],
        [
            'id' => 'BL2',
            'name' => '板橋',
            'addr' => '22041 新北市板橋區站前路5號B1',
        ],
        [
            'id' => 'BL1',
            'name' => '府中',
            'addr' => '22055 新北市板橋區縣民大道一段193號B1',
        ],
        [
            'id' => 'BL40',
            'name' => '亞東醫院',
            'addr' => '22060 新北市板橋區南雅南路二段17號B1',
        ],
        [
            'id' => 'BL39',
            'name' => '海山',
            'addr' => '23660 新北市土城區海山路39號B2',
        ],
        [
            'id' => 'BL38',
            'name' => '土城',
            'addr' => '23671 新北市土城區金城路一段105號B1',
        ],
        [
            'id' => 'BL37',
            'name' => '永寧',
            'addr' => '23671 新北市土城區中央路三段105號B1',
        ],
        [
            'id' => 'BL36',
            'name' => '頂埔',
            'future' => true
        ]
    ]
];

$khh_red = [
    'name' => '紅線',
    'stations' => [
        [
            'id' => 'R24',
            'name' => '南岡山',
            'addr' => '82060 高雄市岡山區中山南路2號',
        ],
        [
            'id' => 'R23',
            'name' => '橋頭火車站',
            'addr' => '82548 高雄市橋頭區站前街12之1號',
        ],
        [
            'id' => 'R22A',
            'name' => '橋頭糖廠',
            'addr' => '82541 高雄市橋頭區興糖路19號',
        ],
        [
            'id' => 'R22',
            'name' => '青埔',
            'addr' => '82546 高雄市橋頭區經武路20號',
        ],
        [
            'id' => 'R21',
            'name' => '都會公園',
            'addr' => '81157 高雄市楠梓區高楠公路1835號',
        ],
        [
            'id' => 'R20',
            'name' => '後勁',
            'addr' => '81157 高雄市楠梓區加昌路178號',
        ],
        [
            'id' => 'R19',
            'name' => '楠梓加工區',
            'addr' => '81170 高雄市楠梓區加昌路598號',
        ],
        [
            'id' => 'R18',
            'name' => '油廠國小',
            'addr' => '81155 高雄市楠梓區左楠路6號',
        ],
        [
            'id' => 'R17',
            'name' => '世運',
            'addr' => '81155 高雄市楠梓區左楠路1號',
        ],
        [
            'id' => 'R16',
            'name' => '左營',
            'addr' => '81361 高雄市左營區高鐵路107號B1',
        ],
        [
            'id' => 'R15',
            'name' => '生態園區',
            'addr' => '81365 高雄市左營區博愛三路435號B1',
        ],
        [
            'id' => 'R14',
            'name' => '巨蛋',
            'addr' => '81355 高雄市左營區博愛二路485號B1',
        ],
        [
            'id' => 'R13',
            'name' => '凹子底',
            'addr' => '80467 高雄市鼓山區博愛二路21號B1',
        ],
        [
            'id' => 'R12',
            'name' => '後驛',
            'addr' => '80757 高雄市三民區博愛一路220號B1',
        ],
        [
            'id' => 'R11',
            'name' => '高雄車站',
            'addr' => '80750 高雄市三民區建國二路320號B1',
        ],
        [
            'id' => 'R10',
            'name' => '美麗島',
            'addr' => '80049 高雄市新興區中山一路115號B1',
        ],
        [
            'id' => 'R9',
            'name' => '中央公園',
            'addr' => '80145 高雄市前金區中山一路11號B1',
        ],
        [
            'id' => 'R8',
            'name' => '三多商圈',
            'addr' => '80660 高雄市前鎮區中山二路268號B1',
        ],
        [
            'id' => 'R7',
            'name' => '獅甲',
            'addr' => '80660 高雄市前鎮區中山三路150號B1',
        ],
        [
            'id' => 'R6',
            'name' => '凱旋',
            'addr' => '80660 高雄市前鎮區中山三路1號B1',
        ],
        [
            'id' => 'R5',
            'name' => '前鎮高中',
            'addr' => '80670 高雄市前鎮區翠亨北路225號B1',
        ],
        [
            'id' => 'R4A',
            'name' => '草衙',
            'addr' => '80665 高雄市前鎮區翠亨南路555號B1',
        ],
        [
            'id' => 'R4',
            'name' => '高雄國際機場',
            'addr' => '81275 高雄市小港區中山四路2之2號B1',
        ],
        [
            'id' => 'R3',
            'name' => '小港',
            'addr' => '81257 高雄市小港區沿海一路280號B1',
        ]
    ]
];

$khh_orange = [
    'name' => '橘線',
    'stations' => [
        [
            'id' => 'O1',
            'name' => '西子灣',
            'addr' => '80443 高雄市鼓山區臨海二路17-1號B1',
        ],
        [
            'id' => 'O2',
            'name' => '鹽埕埔',
            'addr' => '80343 高雄市鹽埕區大勇路96號B1',
        ],
        [
            'id' => 'O4',
            'name' => '市議會',
            'addr' => '80147 高雄市前金區中正四路192-1號B1',
        ],
        [
            'id' => 'O5',
            'name' => '美麗島',
            'addr' => '80049 高雄市新興區中山一路115號B1',
        ],
        [
            'id' => 'O6',
            'name' => '信義國小',
            'addr' => '80052 高雄市新興區中正三路32-1號B1',
        ],
        [
            'id' => 'O7',
            'name' => '文化中心',
            'addr' => '80271 高雄市苓雅區中正二路45號B1',
        ],
        [
            'id' => 'O8',
            'name' => '五塊厝',
            'addr' => '80284 高雄市苓雅區中正一路286號B1',
        ],
        [
            'id' => 'O9',
            'name' => '技擊館',
            'addr' => '80283 高雄市苓雅區中正一路99號B1',
        ],
        [
            'id' => 'O10',
            'name' => '衛武營',
            'addr' => '80284 高雄市苓雅區中正一路2號B1',
        ],
        [
            'id' => 'O11',
            'name' => '鳳山西站',
            'addr' => '83074 高雄市鳳山區自由路281號B1',
        ],
        [
            'id' => 'O12',
            'name' => '鳳山',
            'addr' => '83057 高雄市鳳山區光遠路446號B1',
        ],
        [
            'id' => 'O13',
            'name' => '大東',
            'addr' => '83057 高雄市鳳山區光遠路226號B1',
        ],
        [
            'id' => 'O14',
            'name' => '鳳山國中',
            'addr' => '83065 高雄市鳳山區中山東路225號B1',
        ],
        [
            'id' => 'OT1',
            'name' => '大寮',
            'addr' => '83167 高雄市大寮區捷西路300號',
        ]
    ]
];

$metro = [
    'areas' => [
        [
            'name' => 'Taipei',
            'lines' => [
                $brown,
                $tpe_red,
                $green,
                $tpe_orange,
                $blue,
                $xinbeitou,
                $xiaobitan
            ]
        ],
        [
            'name' => 'Kaohsiung',
            'lines' => [
                $khh_red,
                $khh_orange
            ]
        ],
    ]
];

echo json_encode($metro);