<?php
$brown = [
    'name' => '文湖線',
    'stations' => [
        [
            'id' => 'B11',
            'name' => '南港展覽館',
            'address' => '11568 台北市南港區南港路一段32號',
        ],
        [
            'id' => 'B10',
            'name' => '南港軟體園區',
            'address' => '11568 台北市南港區經貿二路183號',
        ],
        [
            'id' => 'B9',
            'name' => '東湖',
            'address' => '11486 台北市內湖區康寧路三段235號',
        ],
        [
            'id' => 'B8',
            'name' => '葫洲',
            'address' => '11486 台北市內湖區康寧路三段16號',
        ],
        [
            'id' => 'B7',
            'name' => '大湖公園',
            'address' => '11477 台北市內湖區成功路五段11號',
        ],
        [
            'id' => 'B6',
            'name' => '內湖',
            'address' => '11489 台北市內湖區成功路四段186號',
        ],
        [
            'id' => 'B5',
            'name' => '文德',
            'address' => '11475 台北市內湖區文德路214號',
        ],
        [
            'id' => 'B4',
            'name' => '港墘',
            'address' => '11446 台北市內湖區內湖路一段663號',
        ],
        [
            'id' => 'B3',
            'name' => '西湖',
            'address' => '11493 台北市內湖區內湖路一段256號',
        ],
        [
            'id' => 'B2',
            'name' => '劍南路',
            'address' => '10464 台北市中山區北安路798號',
        ],
        [
            'id' => 'B1',
            'name' => '大直',
            'address' => '10465 台北市中山區北安路534之1號',
        ],
        [
            'id' => 'BR1',
            'name' => '松山機場',
            'address' => '10576 台北市松山區敦化北路338號',
        ],
        [
            'id' => 'BR2',
            'name' => '中山國中',
            'address' => '10476 台北市中山區復興北路376號',
        ],
        [
            'id' => 'BR3',
            'name' => '南京東路',
            'address' => '10550 台北市松山區南京東路三段253號',
        ],
        [
            'id' => 'BR4',
            'name' => '忠孝復興',
            'address' => '10654 台北市大安區忠孝東路四段47號',
        ],
        [
            'id' => 'BR5',
            'name' => '大安',
            'address' => '10683 台北市大安區信義路四段2號',
        ],
        [
            'id' => 'BR6',
            'name' => '科技大樓',
            'address' => '10667 台北市大安區復興南路二段235號',
        ],
        [
            'id' => 'BR7',
            'name' => '六張犁',
            'address' => '10674 台北市大安區和平東路三段168號',
        ],
        [
            'id' => 'BR8',
            'name' => '麟光',
            'address' => '10676 台北市大安區和平東路三段410號',
        ],
        [
            'id' => 'BR9',
            'name' => '辛亥',
            'address' => '11694 台北市文山區辛亥路四段128號',
        ],
        [
            'id' => 'BR10',
            'name' => '萬芳醫院',
            'address' => '11696 台北市文山區興隆路三段113號',
        ],
        [
            'id' => 'BR11',
            'name' => '萬芳社區',
            'address' => '11653 台北市文山區萬芳路60號',
        ],
        [
            'id' => 'BR12',
            'name' => '木柵',
            'address' => '11656 台北市文山區木柵路四段135號',
        ],
        [
            'id' => 'BR13',
            'name' => '動物園',
            'address' => '11656 台北市文山區新光路二段32號',
        ]
    ]
];

$tpe_red = [
    'name' => '淡水線',
    'stations' => [
        [
            'id' => 'R33',
            'name' => '淡水',
            'address' => '25158新北市淡水區中正路1號',
        ],
        [
            'id' => 'R32',
            'name' => '紅樹林',
            'address' => '25173新北市淡水區中正東路二段68號',
        ],
        [
            'id' => 'R31',
            'name' => '竹圍',
            'address' => '25173新北市淡水區民權路50號',
        ],
        [
            'id' => 'R30',
            'name' => '關渡',
            'address' => '11259 台北市北投區大度路三段296巷51號',
        ],
        [
            'id' => 'R29',
            'name' => '忠義',
            'address' => '11257 台北市北投區中央北路四段301號',
        ],
        [
            'id' => 'R28',
            'name' => '復興崗',
            'address' => '11257 台北市北投區中央北路三段53巷10號',
        ],
        [
            'id' => 'R26',
            'name' => '北投',
            'address' => '11246 台北市北投區光明路1號',
        ],
        [
            'id' => 'R25',
            'name' => '奇岩',
            'address' => '11270 台北市北投區三合街二段489號',
        ],
        [
            'id' => 'R24',
            'name' => '唭哩岸',
            'address' => '11265 台北市北投區東華街二段301號',
        ],
        [
            'id' => 'R23',
            'name' => '石牌',
            'address' => '11271 台北市北投區石牌路一段200號',
        ],
        [
            'id' => 'R22',
            'name' => '明德',
            'address' => '11280 台北市北投區明德路95號',
        ],
        [
            'id' => 'R21',
            'name' => '芝山',
            'address' => '11158 台北市士林區福國路70號',
        ],
        [
            'id' => 'R20',
            'name' => '士林',
            'address' => '11163 台北市士林區福德路1號',
        ],
        [
            'id' => 'R18A',
            'name' => '劍潭',
            'address' => '11163 台北市士林區中山北路五段65號',
        ],
        [
            'id' => 'R17',
            'name' => '圓山',
            'address' => '10367 台北市大同區酒泉街9之1號',
        ],
        [
            'id' => 'R16',
            'name' => '民權西路',
            'address' => '10365 台北市大同區民權西路72號',
        ],
        [
            'id' => 'R15',
            'name' => '雙連',
            'address' => '10354 台北市大同區民生西路47號',
        ],
        [
            'id' => 'R14',
            'name' => '中山',
            'address' => '10444 台北市中山區南京西路16號',
        ],
        [
            'id' => 'R13',
            'name' => '台北車站',
            'address' => '10041 台北市中正區忠孝西路一段49號',
        ],
        [
            'id' => 'R12',
            'name' => '台大醫院',
            'address' => '10048 台北市中正區公園路52號B1',
        ],
        [
            'id' => 'R11',
            'name' => '中正紀念堂',
            'address' => '10074 台北市中正區羅斯福路一段8之1號B1',
        ],
        [
            'id' => 'R10',
            'name' => '東門',
            'address' => '10650 台北市大安區信義路二段166號B1',
        ],
        [
            'id' => 'R9',
            'name' => '大安森林公園',
        ],
        [
            'id' => 'R8',
            'name' => '大安',
            'address' => '10683 台北市大安區信義路四段2號',
        ],
        [
            'id' => 'R7',
            'name' => '信義安和',
        ],
        [
            'id' => 'R6',
            'name' => '台北101/世貿',
        ],
        [
            'id' => 'R5',
            'name' => '象山',
        ],
    ]
];

$xinbeitou = [
    'name' => '新北投支線',
    'stations' => [
        [
            'id' => 'R27',
            'name' => '新北投',
            'address' => '11268 台北市北投區大業路700號',
        ]
    ]
];

$green = [
    'name' => '新店線',
    'stations' => [
        [
            'id' => 'G22',
            'name' => '松山',
        ],
        [
            'id' => 'G21',
            'name' => '南京三民',
        ],
        [
            'id' => 'G19',
            'name' => '台北小巨蛋',
        ],
        [
            'id' => 'G18',
            'name' => '南京復興',
        ],
        [
            'id' => 'G17',
            'name' => '松江南京',
        ],
        [
            'id' => 'G16',
            'name' => '中山',
        ],
        [
            'id' => 'G14',
            'name' => '北門',
        ],
        [
            'id' => 'G13',
            'name' => '西門',
        ],
        [
            'id' => 'G12',
            'name' => '小南門',
        ],
        [
            'id' => 'G11',
            'name' => '中正紀念堂',
            'address' => '10074 台北市中正區羅斯福路一段8之1號B1',
        ],
        [
            'id' => 'G10',
            'name' => '古亭',
        ],
        [
            'id' => 'G9',
            'name' => '台電大樓',
        ],
        [
            'id' => 'G7',
            'name' => '公館',
        ],
        [
            'id' => 'G6',
            'name' => '萬隆',
        ],
        [
            'id' => 'G5',
            'name' => '景美',
        ],
        [
            'id' => 'G4',
            'name' => '大坪林',
        ],
        [
            'id' => 'G3',
            'name' => '七張',
        ],
        [
            'id' => 'G2',
            'name' => '新店區公所',
        ],
        [
            'id' => 'G1',
            'name' => '新店',
        ]
    ]
];

$xiaobitan = [
    'name' => '小碧潭支線',
    'stations' => [
        [
            'id' => 'G1A',
            'name' => '小碧潭',
        ]
    ]
];

$tpe_orange = [
    'name' => '中和新蘆線',
    'stations' => [
        [
            'id' => 'O43',
            'name' => '蘆洲',
        ],
        [
            'id' => 'O44',
            'name' => '三民高中',
        ],
        [
            'id' => 'O45',
            'name' => '徐匯中學',
        ],
        [
            'id' => 'O46',
            'name' => '三和國中',
        ],
        [
            'id' => 'O47',
            'name' => '三重國小',
        ],
        [
            'id' => 'O59',
            'name' => '迴龍',
        ],
        [
            'id' => 'O60',
            'name' => '丹鳳',
        ],
        [
            'id' => 'O1',
            'name' => '輔大',
        ],
        [
            'id' => 'O2',
            'name' => '新莊',
        ],
        [
            'id' => 'O3',
            'name' => '頭前庄',
        ],
        [
            'id' => 'O4',
            'name' => '先嗇宮',
        ],
        [
            'id' => 'O5',
            'name' => '三重',
        ],
        [
            'id' => 'O6',
            'name' => '菜寮',
        ],
        [
            'id' => 'O7',
            'name' => '台北橋',
        ],
        [
            'id' => 'O8',
            'name' => '大橋頭',
        ],
        [
            'id' => 'O9',
            'name' => '民權西路',
            'address' => '10365 台北市大同區民權西路72號',
        ],
        [
            'id' => 'O10',
            'name' => '中山國小',
        ],
        [
            'id' => 'O11',
            'name' => '行天宮',
        ],
        [
            'id' => 'O12',
            'name' => '松江南京',
        ],
        [
            'id' => 'O13',
            'name' => '忠孝新生',
        ],
        [
            'id' => 'O14',
            'name' => '東門',
        ],
        [
            'id' => 'O15',
            'name' => '古亭',
        ],
        [
            'id' => 'O16',
            'name' => '頂溪',
        ],
        [
            'id' => 'O17',
            'name' => '永安市場',
        ],
        [
            'id' => 'O18',
            'name' => '景安',
        ],
        [
            'id' => 'O19',
            'name' => '南勢角',
        ]
    ]
];

$blue = [
    'name' => '板南線',
    'stations' => [
        [
            'id' => 'BL18',
            'name' => '南港展覽館',
            'address' => '11568 台北市南港區研究院路一段1號',
        ],
        [
            'id' => 'BL17',
            'name' => '南港',
        ],
        [
            'id' => 'BL16',
            'name' => '昆陽',
        ],
        [
            'id' => 'BL15',
            'name' => '後山埤',
        ],
        [
            'id' => 'BL14',
            'name' => '永春',
        ],
        [
            'id' => 'BL13',
            'name' => '市政府',
        ],
        [
            'id' => 'BL12',
            'name' => '國父紀念館',
        ],
        [
            'id' => 'BL11',
            'name' => '忠孝敦化',
        ],
        [
            'id' => 'BL10',
            'name' => '忠孝復興',
            'address' => '10654 台北市大安區忠孝東路四段47號',
        ],
        [
            'id' => 'BL9',
            'name' => '忠孝新生',
        ],
        [
            'id' => 'BL8',
            'name' => '善導寺',
        ],
        [
            'id' => 'BL7',
            'name' => '台北車站',
            'address' => '10041 台北市中正區忠孝西路一段49號',
        ],
        [
            'id' => 'BL6',
            'name' => '西門',
        ],
        [
            'id' => 'BL5',
            'name' => '龍山寺',
        ],
        [
            'id' => 'BL4',
            'name' => '江子翠',
        ],
        [
            'id' => 'BL3',
            'name' => '新埔',
        ],
        [
            'id' => 'BL2',
            'name' => '板橋',
        ],
        [
            'id' => 'BL1',
            'name' => '府中',
        ],
        [
            'id' => 'BL40',
            'name' => '亞東醫院',
        ],
        [
            'id' => 'BL39',
            'name' => '海山',
        ],
        [
            'id' => 'BL38',
            'name' => '土城',
        ],
        [
            'id' => 'BL37',
            'name' => '永寧',
        ],
        [
            'id' => 'BL36',
            'name' => '頂埔',
        ]
    ]
];

$khh_red = [
    'name' => '紅線',
    'stations' => [
        [
            'id' => 'R24',
            'name' => '南岡山',
        ],
        [
            'id' => 'R23',
            'name' => '橋頭火車站',
        ],
        [
            'id' => 'R22A',
            'name' => '橋頭糖廠',
        ],
        [
            'id' => 'R22',
            'name' => '青埔',
        ],
        [
            'id' => 'R21',
            'name' => '都會公園',
        ],
        [
            'id' => 'R20',
            'name' => '後勁',
        ],
        [
            'id' => 'R19',
            'name' => '楠梓加工區',
        ],
        [
            'id' => 'R18',
            'name' => '油廠國小',
        ],
        [
            'id' => 'R17',
            'name' => '世運',
        ],
        [
            'id' => 'R16',
            'name' => '左營',
        ],
        [
            'id' => 'R15',
            'name' => '生態園區',
        ],
        [
            'id' => 'R14',
            'name' => '巨蛋',
        ],
        [
            'id' => 'R13',
            'name' => '凹子底',
        ],
        [
            'id' => 'R12',
            'name' => '後驛',
        ],
        [
            'id' => 'R11',
            'name' => '高雄車站',
        ],
        [
            'id' => 'R10',
            'name' => '美麗島',
        ],
        [
            'id' => 'R9',
            'name' => '中央公園',
        ],
        [
            'id' => 'R8',
            'name' => '三多商圈',
        ],
        [
            'id' => 'R7',
            'name' => '獅甲',
        ],
        [
            'id' => 'R6',
            'name' => '凱旋',
        ],
        [
            'id' => 'R5',
            'name' => '前鎮高中',
        ],
        [
            'id' => 'R4A',
            'name' => '草衙',
        ],
        [
            'id' => 'R4',
            'name' => '高雄國際機場',
        ],
        [
            'id' => 'R3',
            'name' => '小港',
        ]
    ]
];

$khh_orange = [
    'name' => '橘線',
    'stations' => [
        [
            'id' => 'O1',
            'name' => '西子灣',
        ],
        [
            'id' => 'O2',
            'name' => '鹽埕埔',
        ],
        [
            'id' => 'O4',
            'name' => '市議會',
        ],
        [
            'id' => 'O5',
            'name' => '美麗島',
        ],
        [
            'id' => 'O6',
            'name' => '信義國小',
        ],
        [
            'id' => 'O7',
            'name' => '文化中心',
        ],
        [
            'id' => 'O8',
            'name' => '五塊厝',
        ],
        [
            'id' => 'O9',
            'name' => '技擊館',
        ],
        [
            'id' => 'O10',
            'name' => '衛武營',
        ],
        [
            'id' => 'O11',
            'name' => '鳳山西站',
        ],
        [
            'id' => 'O12',
            'name' => '鳳山',
        ],
        [
            'id' => 'O13',
            'name' => '大東',
        ],
        [
            'id' => 'O14',
            'name' => '鳳山國中',
        ],
        [
            'id' => 'OT1',
            'name' => '大寮',
        ]
    ]
];

$metro = [
    'cities' => [
        [
            'name' => 'Taipei',
            'lines' => [
                $brown,
                $tpe_red,
                $green,
                $tpe_orange,
                $blue,
                $xinbeitou,
                $xiaobitan
            ]
        ],
        [
            'name' => 'Kaohsiung',
            'lines' => [
                $khh_red,
                $khh_orange
            ]
        ],
    ]
];

echo json_encode($metro);